/**
 * Created by bigserj on 25.05.17.
 */
import java.util.*;
public class HomeWork2 {
    public static void main(String[] args) {




        //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        // 1.0
        System.out.printf("Task 1:%n");
        //Создайте массив с 10-ю переменными типа int.
        int[] mas1 = {54,23,98,563,5,9,54,75,12,765};
        // 1.1
        // Используя оператор "for" найдите и выведите на экран наименьшее и наибольшее значение в массиве.
        // min value =  "значение которое у вас получилось".
        // max value =  "значение которое у вас получилось".
        int minvalue = mas1[0];
        int maxvalue = mas1[0];
        for (int i=0;i<mas1.length-1;i++){
            if (minvalue > mas1[i+1])
                minvalue = mas1[i+1];
            if (maxvalue < mas1[i+1])
                maxvalue = mas1[i+1];
        }
        System.out.printf("min value = %d%n",minvalue);
        System.out.printf("max value = %d%n",maxvalue);
        // 1.2
        // Далее замените наименьшее значение на 0, а наибольшее значение на 99 и выведите получившийся массив на экран в виде:
        // [23, 0, 34, 99, 43534].
        System.out.print("[");
        for (int i=0;i<mas1.length;i++){
            if (minvalue == mas1[i])
                mas1[i] = 0;
            if (maxvalue == mas1[i])
                mas1[i] = 99;
            if (i!=mas1.length-1)
                System.out.printf("%d, ",mas1[i]);
        }
        System.out.printf("%d].",mas1[mas1.length-1]);




        //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        // 2.0
        System.out.printf("%n%n%n%nTask 2:%n");
        // 2.1
        //Создайте массив с 10-ю переменными типа float.
        float[] mas2 = {3.4f, 6.87f, 23.98f, 2345.65f, 2345.76f, 34.56f, 3.4f, 23.98f, 3.4f, 2345.76f};
        // 2.2
        //Далее найдите дубликаты и выведите их количество.
        for (int i=0;i<mas2.length;i++){
            int dublikatCount = 0;
            for (int j=0;j<i;j++){//проверяем, было ли это значение ранее.
                if (mas2[i] == mas2[j])
                    dublikatCount = -1;
            }
            if (dublikatCount == -1)//Если было - сразу переходим на след итерацию
                continue;
            for (int j=i+1;j<mas2.length;j++){
                if (mas2[i] == mas2[j])
                    dublikatCount++;
            }
            if (dublikatCount != 0)//если есть хотя бы 1 дубль - выводим соотв. строку
                System.out.printf("[%.2f] - повторений %d%n",mas2[i],dublikatCount+1);
        }




        //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        // 3.0
        System.out.printf("%n%n%n%nTask 3:%n");
        // 3.1
        //Напишите программу, которая печатает массив, затем инвертирует
        //(то есть меняет местами первый элемент с последним, второй — с предпоследним и т.д.), и вновь печатает.
        int[] mas3 = {1,2,3,4,5,6,7,8,9,10};
        System.out.printf("Исходный массив: %n[");
        for (int i=0;i<mas3.length-1;i++)
            System.out.printf("%d, ",mas3[i]);
        System.out.printf("%d]%n",mas3[mas3.length-1]);
        //Инвертируем
        for (int i=0;i<mas3.length/2;i++){
            int a = mas3[mas3.length-1-i];
            mas3[mas3.length-1-i] = mas3[i];
            mas3[i] = a;
        }
        System.out.printf("Массив после инвертирования: %n[");
        for (int i=0;i<mas3.length-1;i++)
            System.out.printf("%d, ",mas3[i]);
        System.out.printf("%d]%n",mas3[mas3.length-1]);




        //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        // 4.0
        System.out.printf("%n%n%n%nTask 4:%n");
        // 4.1
        //Создайте массив типа int.
        int[] mas4 = {1,7,5,8,6,3,9,2,5,4};
        //Отсортируйте массив любым способом (по убыванию либо по возрастанию). Результат вывести на экран.
        //String sort = "-";

        Scanner sort = new Scanner(System.in);
        System.out.println("Введите способ сортировки ('+' -по возрастанию, '-' -по убыванию): ");
        String input = sort.next();

        for (int i=0;i<mas4.length-1;i++){
            for (int j=i+1;j<mas4.length;j++){
                if (input.equals("+")) {//сортировка по возрастанию
                    if (mas4[i] > mas4[j]) {
                        int a = mas4[i];
                        mas4[i] = mas4[j];
                        mas4[j] = a;
                    }
                }else if (input.equals("-")){
                    if (mas4[i] < mas4[j]) {
                        int a = mas4[i];
                        mas4[i] = mas4[j];
                        mas4[j] = a;
                    }
                }
            }
        }
        if (input.equals("+"))//сортировка по возрастанию
            System.out.printf("Вы выбрали по возрастанию: %n[");
        else if (input.equals("-"))
            System.out.printf("Вы выбрали по убыванию: %n[");
        if (input.equals("+") || input.equals("-")) {
            for (int i = 0; i < mas4.length - 1; i++)
                System.out.printf("%d, ", mas4[i]);
            System.out.printf("%d]%n", mas4[mas4.length - 1]);
        }else{
            System.out.println("Вы не выбрали способ сортировки: '+' -по возрастанию, '-' -по убыванию.");
        }
    }
}













