/**
 * Created by bigserj on 24.05.17.
 */
import static java.lang.Math.*;
public class HomeWork1 {

    public static void main(String[] args) {




        //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        // 1.0
        System.out.printf("Task 1:%n");
        //Создайте переменную типа String c любым текстом (не сильно короткое).
        String str = "У нас в квартире кот живет. У нас не мало с ним хлопот.";
        // 1.1
        //Далее выведите на экран количество символов в данной строке.
        int strLength = str.length();
        System.out.printf("Количество символов в заданной строке: %d%n",strLength);
        // 1.2
        /*
            Далее разделите строку пополам (если ровно поделить не выходит то +-1 не страшно),
            в результате у вас должно быть 2-е новых переменных типа String с частями из изначальной строки.
            Полученные строки выведите на экран.
        */
        String str1 = str.substring(0,strLength/2);
        String str2 = str.substring(strLength/2,strLength);
        System.out.printf("Первая половина строки: '%s'%n",str1);
        System.out.printf("Вторая половина строки: '%s'%n",str2);







        //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        // 2.0
        System.out.printf("%n%n%nTask 2:%n");
        // Создайте любое число (???переменную???).
        int anyNumb = 54636;
        // Определите, является ли последняя цифра числа семеркой.
        if (Integer.toString(anyNumb).endsWith("7"))
            System.out.println("последняя цифра числа является семеркой");
        else
            System.out.println("последняя цифра числа не является семеркой");






        //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        // 3.0
        System.out.printf("%n%n%nTask 3:%n");
        /*
            Имеется прямоугольное отверстие размерами a и b (размеры задать любые),
            определить, можно ли его полностью закрыть круглой картонкой радиусом r
            (тоже подставляем любое значение).
         */
        int a = 3;
        int b = 4;
        int r = 3;
        System.out.printf("Размеры отверстия: %d на %d, радиус картонки: %d.%n",a,b,r);
        if (r*2 >= sqrt(a*a+b*b))
            System.out.println("картонка перекроет отверстие");
        else
            System.out.println("картонка не перекроет отверстие");






        //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        // 4.0
        System.out.printf("%n%n%nTask 4:%n");
        /*
            Имеется целое число (любое), это число — сумма денег в рублях.
            Вывести это число, добавив к нему слово «рублей» в правильном падеже.
        */
        int xRubl = 66774533;
        String rublPadezh;
        switch (xRubl%10){
            case 1: rublPadezh = "рубль";break;
            case 2: rublPadezh = "рубля";break;
            case 3: rublPadezh = "рубля";break;
            case 4: rublPadezh = "рубля";break;
            default: rublPadezh = "рублей";break;
        }
        System.out.printf("%d %s%n",xRubl,rublPadezh);
        /*
            0 - рублей
            1 - рубль
            2 - рубля
            3 - рубля
            4 - рубля
            5 - рублей
            6 - рублей
            7 - рублей
            8 - рублей
            9 - рублей
         */






        //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        // 5.0
        System.out.printf("%n%n%nTask 5:%n");
        /*
            Имеется строка, которая содержит символы ? и символы #.
            Замените все символы ? на HELLO, а # - удалите. Результат вывести на экран.
        */
        String someLongString = "п765rg db gfл?мары пр% №# gfnja# кпрп куыппдр ?gtr ? ио? E# правы?пыирп пр уплы ? ропклыдп# fgf# иавыпр #";
        String someLongStringReplaced = someLongString.replace("?","HELLO").replaceAll("#","");
        System.out.printf("%s%n",someLongStringReplaced);






        //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        // 6.0
        System.out.printf("%n%n%nTask 6:%n");
        /*
            выражение: y=(sin(x(*t))*sin(x(*t)))/(sqrt(1+x(*s)))
        */
        int x = 5;
        int t = 3;
        int s = 2;

        double y = ((pow(sin(pow(x,t)),2))/(sqrt(1+pow(x,s))));
        System.out.printf("%f%n%n%n%n",y);
    }
}
